--70

--uruchomienie systemu z pierwszego dostępnego obrazu
rommon > reset 	

--w konsoli
Router>enable
Router#conf t 			--tryb konfiguracyjny
	--wstępna konfiguracja rutera
Router(config)#no ip domain-lookup	--wyłączenie klienta DNS	
Router(config)#no service config	--wyłączenie pobierania konfiguracji przez TFTP 
Router#terminal length 0 	--wyłączenie stronicowania przy wypisywaniu dłuższych raportów na konsoli

--Router#write mem v Router#copy running-config startup-config.
--Router#reload
--Router#write erase

	--Przykład aktywowania interfejsu do edycji:
Router(config)#interface serial 0/0 
Router(config-if)# 
	--Przykład konfigurowania adresu IP w interfejsie FastEthernet 0/1 i uruchomienia interfejsu
Router(config)#interface FastEthernet 0/1 
Router(config-if)#ip address 192.168.123.100 255.255.255.0
Router(config-if)#no shutdown 
	--tworzenie interfejsów wirtualnych 
Router(config)#interface Loopback 0
Router(config-if)#ip address 10.0.0.1 255.255.255.0
Router(config-if)#no shutdown 
	--sprawdzenie
Router#show ip int fa 0/1 
Router#show interfaces summary 
Router#show interfaces fa 0/1summary 
Router#show interfaces description 
Router#show interfaces accounting 
Router#show interfaces fa 0/1 accounting 
Router#show interfaces fa 0/1 
Router#show controllers fa 0/1 
Router#show run 

--B
	--Definiowanie nazwy hosta dla rutera 
Router(config)#hostname R1	
	--Sprawdzenie stanu interfejsów IP
Router#show ip interface brief 
Router#show interfaces description
	--Włączenie filtrowania rodzaju komunikatów systemowych
Router(config)#logging console 2
	--Sprawdzenie konfiguracji (bieżącej i tymczasowej)
Router#show running-config 
	--Sprawdzenie konfiguracji NVRAM (trwałej)
Router#show startup-config 
	--Sprawdzenie listy zalogowanych użytkowników (telnet, ssh) i ich sesji
Router#sh users 
Router#sh sessions
	--Diagnostyka ICMP/ping: możliwe jest uruchomienie długiej serii ping: Router#ping 192.168.1.1 rep 1000(liczba powtórzeń.) CTRL+SHIFT+6 =stop 
Router#ping 192.168.1.1 rep 1000
	--Sprawdzenie zawartości tablicy ARP 
Router#show arp
	--Testowanie funkcjonowania protokoł CDP,identyfikacja sąsiadów rutera
	--Podłącz do wybranego interfejsu IP rutera interfejs IP drugiego rutera Cisco. Skonfiguruj interfejsy w ruterach, nadając im poprawną adresację IP (tak aby adresy znajdowały sie w jednej sieci IP)
outer#sh cdp     
Router#sh cdp neighbors     
Router#sh cdp neighbors detail 
	--Włączenie/wyłączenie cdp: 
Router(config)#no cdp run    
Router(config)# cdp run
	--Wyłączenie CDP w konkretnym interfejsie
uter(config)#interface fa 0/1    
Router(config)#no cdp enable 
	--Sprawdzenie CDP dla interfejsów    
Router#sh cdp interface
	--Kasowanie zawartości tablicy z informacjami o innych urządzeniach zgromadzonymi przez CDP    
Router#clear cdp table
	--Konfigurowanie prędkości i czasu aktualności komunikatu CDP (w sekundach)
Ruter(config)#cdp timer 10
Router(config)#cdp holdtime 90
	--Zmień parametry prędkości nadawania i czasu aktualności o obydwu ruterach. Następnie skonfiguruj w jednym z nich nową nazwę hosta, obserwując czas rozpropagowania tej informacji do przeciwległego rutera przy użyciu CDP
Router1(config)#hostname inna
Router1#show cdp neighbors

--C
	--włączyć usługę DHCP w ruterze R1:
R1(config)#service dhcp
	--skonfigurować w nim parametry DHCP, ta sama sieć!
Router(config)#ip dhcp pool nazwa 
Router(dhcp-config)#network 10.10.10.0 255.255.255.0 
Router(dhcp-config)#default-router 10.10.10.1 
Router(dhcp-config)#dns-server 123.123.123.3 
Router(dhcp-config)#domain-name domena.pl 
Router(dhcp-config)#exit 
Router(config)#ip dhcp excluded-address 10.10.10.10  10.10.10.20 
	--Interfejs stacji PC oraz podłączony do R1 interfejs rutera R2 należy skonfigurować w trybie klienta DHCP 
R2(config)#interface FastEthernet 0/0 
R2(config-if)#ip address dhcp
	--sprawdzić stan serwera DHCP w ruterze R1
Router#show ip dhcp binding
	--diagnostyka
Router#debug ip dhcp server events
	--serwer DHCP nie musi konfigurować wyłącznie sieci bezpośrednio podłączonych
Router(config-if)#ip helper-address 200.200.200.1 --gdzie 200.200.200.1 to adres kolejnego rutera na trasie zapytania do serwera DHCP 

--D
	--konfigurowanie legacy bridging
	--W ruterze R1 (bezpośrednio podłączonym do PC) należy usunąć adresację IP z interfejsów, wyłączyć rutowanie IP, a interfejsy połączyć w mostek (w przykładzie poniżej - mostek numer 1)
Router(config)#int fa 0/0 
Router(config-if)#brigde-group 1 
Router(config-if)#no ip address 
Router(config)#exit 
Router(config)#int fa 0/1 
Router(config-if)#brigde-group 1 
Router(config-if)#no ip address 
Router(config)#exit 
Router(config)#no ip routing 
	--zezwolić na przesyłanie ramek Ethernet przez mostek numer 1
Router(config)#bridge 1 protocol ieee 	--Aby mostek został utworzony, przynajmniej dwa interfejsy do niego zakwalifikowane musza być w stanie up
	--Po skonfigurowaniu rutera R1 należy zmienić adresację interfejsu IP w ruterze R2, tak aby znajdował się on w tej samej sieci IP, co interfejs stacji PC. 
	--Wykonaj śledzenie trasy (traceroute) pomiędzy R2 i stacją PC. Zauważ, że ruter  R1 przestał być na tej trasie widoczny (funkcjonuje jako mostek). Sprawdź możliwość ustawienia i stan mostka w ruterze R1
Router#show bridge group 
Router#show bridge 
	--stan Spanning Tree w mostku 
R1#show spanning-tree brief 

	--modyfikacji konfiguracji z poprzedniego punktu
	--Włącz ponownie rutowanie IP
Router(config)# ip routing
	--Uruchom mostkowanie CRB
Router(config)# bridge crb
	--Wyłącz mostek 1 z procesu rutowania IP
Router(config)# no bridge 1 route ip
	--Włącz mostek 1 do procesu mostkowania IP
Router(config)# bridge 1 bridge ip 
	--ponowny tracerout tym razem przy włączonym już rutowaniu IP, lecz nie obejmującym mostka.

	--Konfigurowanie IRB
	--Wyłącz mostkowanie CRB i uruchom mostkowanie IRB
Router(config)# no bridge crb 
Router(config)# bridge irb
	--Włącz mostek 1 do procesu mostkowania IP
Router(config)# bridge 1 bridge ip
	--Włącz mostek 1 do procesu rutowania IP
Router(config)# bridge 1 route ip 
	--Tworzenie interfejsu BVI i konfigurowanie jego adresu
Router(config)#interface BVI 1 
Router(config-if)#ip address 200.200.200.3  255.255.255.0
Router(config-if)#no shutdown 
	--umer interfejsu BVI musi być zgodny z numerem mostka nadanym za pośrednictwem polecenia bridge-group, tracerout








