--72

Podpiąć 
Ruter fa1->PC1
Ruter fa2->PC2

Konfig Interface
```
Router>enable
Router#conf t 			--tryb konfiguracyjny

--Przykład konfigurowania adresu IP w interfejsie FastEthernet 0/1 i uruchomienia interfejsu
Router(config)#interface FastEthernet 0/1 
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#no shutdown

--Przykład konfigurowania adresu IP w interfejsie FastEthernet 0/2 i uruchomienia interfejsu
Router(config)#interface FastEthernet 0/2 
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#no shutdown
 
Router(config)#ip routing
```
Ustawić Ip w PC1 (preferencje połączenia ip 192.168.1.2 255.255.255.0 gateway: 192.168.1.1)
Ustawić Ip w PC2 (preferencje połączenia ip 192.168.2.2 255.255.255.0 gateway: 192.168.2.1)
```
--sprawdzenie
Router#show ip int fa 0/1 
Router#show ip int fa 0/2
Router#show interfaces summary 
Router#show interfaces fa 0/1 summary 
Router#show interfaces fa 0/2 summary 
Router#show interfaces description 
Router#show interfaces accounting 
Router#show interfaces fa 0/1 accounting 
Router#show interfaces fa 0/2 accounting 
Router#show interfaces fa 0/1 
Router#show interfaces fa 0/2
Router#show controllers fa 0/1
Router#show controllers fa 0/2 
Router#show run 
```

Na Komputerach:
```
ping 192.168.1.2
ping 192.168.2.2
```

A

Tworzenie listy dostępu:
```
Router(config)#access-list 70 deny host 192.168.1.2
Router(config)#access-list 70 permit any
Router(config)#access-list 70 remark To jest lista usuwająca 192.168.1.2
Router(config)#int fe 0/0
Router(config-if)#ip access-group 70 in
```
sprawdzenie
```
Router#show access-lists
Router#show access-lists fa0/0 in
Router#show run 
```

Na Komputerach:
```
ping 192.168.1.2
ping 192.168.2.2
```
Usunięcie listy
```
Router(config)#int fe 0/0
Router(config-if)#no ip access-group 70 in
Router(config)#no access-list standard 70
```
sprawdzenie
```
Router#show access-lists
Router#show access-lists fa0/0 in
Router#show run 
```

Na Komputerach:
```
ping 192.168.1.2
ping 192.168.2.2
```

```
Router#clear access-list counters
```

B 
Rozrzeżone listy

```
Router(config)#access-list 170 deny tcp host tcp 192.168.1.2 any eq 80
Router(config)#access-list 170 permit ip any any
Router(config)#int fe 0/0
Router(config-if)#ip access-group 170 in
```
sprawdzenie
```
Router#show access-lists
Router#show access-lists fa0/0 in
Router#show run 
```

Na Komputerach:
```
ping 192.168.1.2
ping 192.168.2.2
```
Usunięcie listy
```
Router(config)#int fe 0/0
Router(config-if)#no ip access-group 170 in
Router(config)#no access-list standard 170
```
sprawdzenie
```
Router#show access-lists
Router#show access-lists fa0/0 in
Router#show run 
```

Na Komputerach:
```
ping 192.168.1.2
ping 192.168.2.2
```

```
Router#clear access-list counters
```

C


```
Router(config)#access-list extended BonusList
Router(config-ext-nacl)#deny tcp host tcp 192.168.1.2 any eq 80
Router(config-ext-nacl)#permit ip any any
Router(config)#int fe 0/0
Router(config-if)#ip access-group BonusList in
```
sprawdzenie
```
Router#show access-lists
Router#show access-lists fa0/0 in
Router#show run 
```

Na Komputerach:
```
ping 192.168.1.2
ping 192.168.2.2
```
Usunięcie listy
```
Router(config)#int fe 0/0
Router(config-if)#no ip access-group BonusList in
Router(config)#no access-list standard BonusList
```
sprawdzenie
```
Router#show access-lists
Router#show access-lists fa0/0 in
Router#show run 
```

Na Komputerach:
```
ping 192.168.1.2
ping 192.168.2.2
```

```
Router#clear access-list counters
```
